import { useTranslation } from "react-i18next";

const PNG = () => {
  const { t } = useTranslation();

  return (
    <div className="text-[20px] leading-[20px] mt-[40px]">
      <div className="mb-[20px] text-center">
        <img
          src="https://it-inzhener.com/img/articles/base/1959794105.png"
          alt=""
        />
      </div>

      <div>
        {t(
          "Формат Portable Network Graphics (PNG) був розроблений у 1995 році як універсальний замінник формату GIF. Він є форматом стиснення зображень без втрат, що означає, що якість зображення зберігається при стисканні.Однією з основних переваг PNG є можливість використання прозорості. Оскільки формат PNG зберігає інформацію про прозорість, він стає дуже зручним для створення та використання зображень із прозорими фонами. Крім того, PNG може використовуватися для створення зображень із альфа-каналом, який дозволяє робити зображення напівпрозорими.Однією з особливостей формату PNG є його здатність зберігати зображення у форматі TrueColor з палітрою 24 біт на піксель. Це означає, що PNG може зберігати широкий діапазон кольорів, ніж формат GIF, який використовує всього 8 біт на піксель.Формат PNG також може зберігати метадані, такі як інформацію про авторське право, ключові слова і т.д. Це робить його дуже зручним для використання веб-дизайнерами та іншими професійними користувачами.Незважаючи на ці переваги, формат PNG не підходить для всіх випадків. Зображення у форматі PNG можуть займати більше місця на диску, ніж зображення у форматі JPEG, що робить його менш придатним для зберігання великих зображень або зображень з високою роздільною здатністю. Крім того, PNG не підтримує анімацію на відміну від формату GIF.Деякі програми можуть мати проблеми з відображенням зображень у форматі PNG, особливо якщо вони не оновлюють бібліотеки форматів файлів. Крім того, PNG може бути більш витратним для обробки, ніж деякі інші формати.Загалом формат PNG є дуже зручним і гнучким форматом для зберігання зображень. Він може використовуватися в різних областях, від веб-дизайну до графічного дизайну. Однак перед використанням PNG необхідно переконатися, що цей формат підходить для конкретного завдання, оскільки він може мати свої обмеження та недоліки.Для відкриття файлів у форматі PNG необхідно використовувати програмне забезпечення, яке підтримує цей формат. У комп'ютерних операційних системах Windows та macOS установка простого переглядача зображень, такого як Windows Photo Viewer або Preview, зазвичай дозволяє відкривати файли у форматі PNG.Також існує багато програм для редагування зображень, які підтримують формат PNG. Деякі з найпопулярніших програм у цій галузі включають Adobe Photoshop, GIMP, Paint.NET та Inkscape.Якщо потрібно конвертувати файл з іншого формату в PNG, ви можете використовувати спеціалізовані програми для конвертації зображень, такі як XnConvert, Format Factory або Online-Convert.Загалом, для відкриття файлів у форматі PNG вам потрібно встановити відповідне програмне забезпечення або використовувати онлайн-конвертери, якщо потрібно зробити конвертацію у цей формат."
        )}
      </div>

      <div>
        {t(
          "PNG (Portable Network Graphics) - це формат зображення, який широко використовується в Інтернеті та графічних додатках. На відміну від інших популярних форматів, таких як JPEG і GIF, PNG використовує безвтратне стиснення, що означає, що воно зберігає всю інформацію про зображення без втрати якості. Нижче наведено докладну інформацію про формат PNG: Безвтратне стиснення: Формат PNG використовує алгоритми безвтратного стиснення даних, такі як Deflate, для зменшення розміру файлу без втрати якості зображення. Це означає, що кожен піксель зберігається точно, і ви не втрачаєте деталей при стисненні. Підтримка прозорості: Однією з важливих особливостей формату PNG є його здатність до підтримки прозорості. Зображення у форматі PNG можуть мати альфа-канал, що дозволяє встановлювати прозорість для окремих пікселів. Це особливо корисно для створення графіки з прозорим фоном або накладання зображень одне на одне. Висока точність передачі кольору: PNG підтримує 24-бітовий колірний простір, що означає, що він може відтворювати багато кольорів і деталей у зображеннях. Він зберігає кольори без втрати якості і дозволяє точну передачу кольорів у порівнянні з форматом JPEG, який використовує стиснення з втратами. Масова підтримка браузерами: Формат PNG підтримується всіма сучасними веб-браузерами, що робить його ідеальним для використання в веб-розробці. Це означає, що ви можете впевнено використовувати зображення у форматі PNG на своєму веб-сайті, знаючи, що вони будуть відображатись на будь-якому браузері без проблем."
        )}
      </div>

      <div className="text-center my-[40px]">
        <img
          src="https://www.adobe.com/content/dam/cc/us/en/creativecloud/file-types/image/raster/png-file/thumbnail.jpeg "
          alt=""
          className="h-[400px]"
        />
      </div>
      <div className="mt-[20px]">
        {t(
          "Додатково, формат PNG має кілька варіацій: PNG-8: Це варіант PNG, який використовує індексовану колірну палітру, обмежену до 256 кольорів. Він дозволяє зберігати зображення з використанням меншої кількості даних, що корисно для маленьких анімаційних файлів або іконок. PNG-24: Це повна кольорова версія PNG, яка використовує 24-бітовий колірний простір RGB. Вона зберігає кожен піксель у своєму точному значенні кольору, забезпечуючи високу якість зображення. PNG-32: Це варіант PNG, який додатково підтримує альфа-канал. Він дозволяє встановлювати прозорість для кожного пікселя зображення, що дає більшу гнучкість при створенні графічних ефектів та накладанні зображень. Зазначена гнучкість і підтримка прозорості роблять формат PNG популярним в графічному дизайні, веб-розробці, створенні логотипів, іконок та ілюстрацій. Однак, варто враховувати, що через безвтратне стиснення, файли PNG можуть бути більшими за розміром, ніж файли JPEG, особливо для фотографій. Узагальнюючи, формат PNG є важливим інструментом для зберігання зображень з високою якістю, підтримкою прозорості та точною передачею кольорів. Він забезпечує широку сумісність з браузерами і застосовується в різних галузях"
        )}
      </div>

      <div className="mt-[20px]">
        {t(
          "Формат PNG є ефективним рішенням для зберігання зображень з прозорістю, градієнтами та текстурами, оскільки він дозволяє точно відтворити ці елементи без втрати якості. При використанні формату PNG важливо враховувати розмір файлу. Завдяки безвтратному стисненню, PNG-зображення можуть бути більшими, ніж їх еквіваленти у форматі JPEG. Тому, якщо розмір файлу є критичним фактором, можливо, слід розглянути інші формати зображень.\n\nКрім того, важливо використовувати відповідний тип PNG в залежності від ваших потреб. PNG-8 є ідеальним варіантом для зображень з обмеженою палітрою кольорів, таких як іконки або маленькі анімаційні файли. PNG-24 забезпечує повний колірний спектр і використовується для зображень з багатими деталями та градієнтами. PNG-32 є розширенням PNG-24 і додає підтримку альфа-каналу для прозорості.Загалом, вибір правильного формату зображення, зокрема PNG, залежить від вашої конкретної ситуації. Розгляньте потреби вашого проекту, тип контенту та критерії якості зображення, щоб визначити, чи відповідає формат PNG вашим вимогам."
        )}
      </div>
    </div>
  );
};

export default PNG;
