{
  "Мова": "Language",
  "Фото": "Photo",
  "Відео": "Video",
  "Аудіо": "Audio",
  "Приклади": "Examples",
  "Завантаження": "Loading",
  "Завантажити": "Download",
  "Демонстрація фото": "Photo demo",
  "Зробити фото": "Take photo",
  "Демонстрація відео": "Video demo",
  "Зняти відео": "Make a video",
  "Демонстрація аудіо": "Audio demo",
  "Записати аудіо": "Record audio",
  "Очистити": "Clear",
  "Запис": "Record",
  "Зупинити запис та прослухати": "Stop recording and listen",
  "Запис аудіо": "Audio record",
  "Вибір правильного формату фото має важливе значення з кількох причин:\n\nЯкість зображення: Різні формати мають різні рівні стиснення і якості зображення. Наприклад, JPEG забезпечує хорошу якість при відносно невеликому розмірі файлу, що є важливим для фотографій з високою роздільною здатністю. З іншого боку, PNG забезпечує безвтратне стиснення і кращу точність передачі кольору, що корисно для графіки з прозорістю. Важливо збалансувати якість зображення і розмір файлу, оскільки великі розміри файлів можуть сповільнити завантаження сторінок.\n\nПрозорість: Якщо вам потрібна прозорість у зображенні, наприклад, для логотипів або графіки з прозорим фоном, вибір формату, який підтримує прозорість, такий як PNG, буде важливим. JPEG не підтримує прозорість, тому для цих випадків він не є найкращим варіантом.\n\nАнімація: Якщо ви хочете відтворювати анімацію на своєму веб-сайті, GIF може бути відмінним варіантом, оскільки він підтримує послідовність зображень.\n\nПідтримка браузерами: Важливо також враховувати, які формати підтримуються різними браузерами. Більшість сучасних браузерів підтримують JPEG, PNG і GIF. Однак, нові формати, такі як WebP і AVIF, можуть не бути підтримані у всіх браузерах. Тому вибір формату також залежить від цільової аудиторії вашого веб-сайту.": "Choosing the right photo format is important for several reasons:\n\nImage quality: Different formats have different levels of compression and image quality. For example, JPEG provides good quality with a relatively small file size, which is important for high-resolution photos. On the other hand, PNG provides lossless compression and better color accuracy, which is useful for graphics with transparency. It's important to balance image quality and file size, as large file sizes can slow down page loading.\n\nTransparency: If you need transparency in your image, for example, for logos or graphics with transparent backgrounds, choosing a format that supports transparency, such as PNG, will be important. JPEG does not support transparency, so it is not the best option for these cases.\n\nAnimations: If you want to play animations on your website, GIF can be a great option because it supports image sequences.\n\nBrowser support: It is also important to consider which formats are supported by different browsers. Most modern browsers support JPEG, PNG, and GIF. However, newer formats such as WebP and AVIF may not be supported in all browsers. Therefore, the choice of format also depends on the target audience of your website.",
  "Той, хто коли-небудь користувався Інтернетом, ймовірно, бачив зображення в форматі JPEG. На сьогоднішній день це найпоширеніший спосіб кодування, надсилання по мережі і зберігання зображень. Формат JPEG використовується мільярди разів на день. Без JPEG Всесвітня павутина була б трохи менш барвистою, набагато повільнішою і, ймовірно, не володіла б таким багатством зображень кішок!": "Anyone who has ever used the Internet has probably seen a JPEG image. Today, it is the most common way to encode, send over the network, and store images. The JPEG format is used billions of times a day. Without JPEGs, the World Wide Web would be a little less colorful, a lot slower, and probably not have such a wealth of cat images!",
  "Сьогодні ви можете надіслати зображення у форматі JPEG другу по електронній пошті, не турбуючись про те, який пристрій, браузер або операційну систему він використовує. Але так було не завжди. На початку 1980-х комп’ютери вже могли зберігати і відображати цифрові зображення, але існувало багато конкуруючих ідей та підходів для цієї реалізації. Ви не могли просто надіслати картинку з одного комп’ютера на інший і очікувати, що це буде нормально працювати.": "Today, you can send a JPEG image to a friend via email without worrying about what device, browser, or operating system they're using. But it wasn't always like this. In the early 1980s, computers could already store and display digital images, but there were many competing ideas and approaches to making this happen. You couldn't just send a picture from one computer to another and expect it to work properly.",
  "Для вирішення цієї проблеми в 1986 році спільними зусиллями ISO (Міжнародна організація по стандартизації) та IEC (Міжнародна електротехнічна комісія) була створена Об’єднана група експертів по фотографії (Joint Photographic Experts Group – абревіатура JPEG) зі штаб-квартирою в Женеві (Швейцарія).": "To solve this problem, in 1986, the Joint Photographic Experts Group (JPEG), headquartered in Geneva, Switzerland, was created by the ISO (International Organization for Standardization) and the IEC (International Electrotechnical Commission).",
  "JPEG, група експертів, створила JPEG, стандарт стиснення цифрових зображень, в 1992 році.": "To solve this problem, in 1986, the Joint Photographic Experts Group (JPEG), headquartered in Geneva, Switzerland, was created by the ISO (International Organization for Standardization) and the IEC (International Electrotechnical Commission).",
  "Основа": "Base",
  "Технічні деталі": "Technical details",
  "Загальна інформація": "General information",
  "Переваги": "Advantages",
  "Недоліки": "Disadvantages",
  "Процес стиснення": "Compression process",
  "Колірна субдискретизація": "Color sub-sampling",
  "Квантування": "Quantization",
  "Кодування Гаффмана": "Huffman coding",
  "Як зберігати": "How to store",
  "Вся інформація на комп’ютері зберігається у вигляді серії двійкових чисел. Як правило, це біти, нулі і одиниці, що об’єднуються в групи по вісім, відомі як байти. Коли ви відкриваєте зображення JPEG на своєму комп’ютері, щось (браузер, ваша операційна система або щось ще) повинно декодувати байти, щоб відновити вихідне зображення у вигляді списку кольорів, які потім можна відобразити.": "All information on a computer is stored as a series of binary numbers. As a rule, these are bits, zeros, and ones that are organized into groups of eight, known as bytes. When you open a JPEG image on your computer, something (a browser, your operating system, or something else) has to decode the bytes to restore the original image as a list of of colors that can then be displayed.",
  "Якщо ви відкриєте будь-яке зображення за допомогою текстового редактора (наприклад, Notepad++), ви побачите купу спотворених символів. Відкривши зображення в текстовому редакторі, ви заплутали комп’ютер, точно таким чином, як заплутали свій мозок, коли занадто сильно терли очі і тоді починаєте бачити тьмяні плями та кольори!": "If you open any image with a text editor (such as Notepad++), you will see a bunch of distorted characters. By opening the image in a text editor, you have confused the computer, just as you confuse your brain when you rub your eyes too hard and then start seeing dull spots and colors!",
  "Ці тьмяні плями, які ви бачите – відомі як фосфени – не походять від будь-яких світлових стимулів, і при цьому вони не є галюцинаціями, створеними вашим розумом. Вони виникають тому, що ваш мозок передбачає, що будь-який електричний сигнал, що надходить через нерви в ваше око, передає світлову інформацію. Мозок повинен зробити це припущення, тому що немає ніякого способу дізнатися, чи є даний сигнал звуком, образом або чимось ще. Всі нерви в вашому тілі несуть електричний імпульс однакового типу. Коли ви чините тиск, потираючи очі, ви посилаєте невізуальні сигнали, що запускають рецептори в вашому оці, які ваш мозок інтерпретує – в даному випадку неправильно – як образ. І ви буквально бачите тиск на очі!Комп’ютери багато в чому схожі на наш мозок, — тут важлива правильна інтерпретація сигналів. Всі двійкові дані складаються з одиниць і нулів, базових компонентів, які можуть передавати будь-яку інформацію. Ваш комп’ютер часто здогадується, як її інтерпретувати, використовуючи підказки (наприклад, розширення файлу). Тут ми змусили його інтерпретувати картинку як текст, тому що саме цього чекає текстовий редактор.Якщо ж ви відкриєте картинку в HEX-редакторі, то ви побачите просто великий набір цифр. У таких редакторах байти представлені у вигляді десяткових чисел. Ви можете вносити зміни в байти, і редактор буде змінювати зображення. А для перегляду зображень, закодованих в форматі JPEG, спочатку їх треба декодувати. Цей процес виконується спеціальною програмою поетапно, але в зворотному кодуванню порядку.": "These dim spots you see - known as phosphenes - do not come from any light stimuli, and they are not hallucinations created by your mind. They occur because your brain assumes that any electrical signal traveling through the nerves to your eye is transmitting light information. The brain has to make this assumption because there is no way to know if the signal is a sound, an image, or something else. All the nerves in your body carry the same type of electrical impulse. When you apply pressure by rubbing your eyes, you are sending non-visual signals that trigger receptors in your eye that your brain interprets - in this case, incorrectly - as an image. And you literally see the pressure on your eyes! Computers are a lot like our brains - the correct interpretation of signals is important. All binary data consists of ones and zeros, the basic components that can transmit any information. Your computer often guesses how to interpret it by using clues (e.g., file extensions). Here, we made it interpret the image as text, because that's what a text editor expects.If you open the image in a HEX editor, you'll see just a big set of numbers. In such editors, bytes are represented as decimal numbers. You can make changes to the bytes, and the editor will change the image. To view images encoded in JPEG format, you must first decode them. This process is performed by a special program step by step, but in the reverse of the encoding order.",
  "Загальна інформація про формат JPEG": "General information about the JPEG format",
  "Файли зображень в форматі JPEG мають наступні розширення: JPG, JFIF, JPE і JPEG. На сьогоднішній день найпоширенішим варіантом є розширення JPG.\nЗберігання графічної інформації у файловому форматі JPEG використовує алгоритм методу стиснення з втратами. Це дозволяє стискати дані з досить високою ефективністю. У форматі JPEG можна зберігати картинки з глибиною кольору до 24 біт/піксель і розміром їх сторін не більше 65535 пікселів (2311,93 см).\nВ JPEG не зберігається альфа-канал (прозорість).": "JPEG image files have the following extensions: JPG, JFIF, JPE, and JPEG. Today, the most common option is the JPG extension.\nStoring graphic information in the JPEG file format uses the algorithm of the lossy compression method. This allows you to compress data with a fairly high efficiency. You can save images in JPEG format with a color depth of up to 24 bits/pixel and a side size of no more than 65535 pixels (2311.93 cm).\nJPEG does not store the alpha channel (transparency).",
  "Переваги та недоліки": "Advantages and disadvantages",
  "Формат JPEG набув популярності завдяки своєму алгоритму стиснення, який дозволяє значно стискати інформацію і при цьому зберігати основні кольори та яскравість. Файли в цьому форматі можуть мати невеликий розмір, але при цьому зберігати прийнятну якість зображень.\n\nЦей формат використовується у більшості цифрових фотокамер.\n\nЗображення в форматі JPEG можна без проблем переглянути на будь-якому електронному пристрої: комп’ютер, телевізор, смартфон, ігрова приставка і так далі. Цей формат підтримується у всіх основних операційних системах: Mac OS, Linux, Windows, Android, iOS.": "The JPEG format has gained popularity due to its compression algorithm, which allows for significant compression of information while maintaining primary colors and brightness. Files in this format can be small in size, but still maintain acceptable image quality.\n\nThis format is used in most digital cameras.\n\nJPEG images can be viewed on any electronic device without any problems: computer, TV, smartphone, game console, etc. This format is supported by all major operating systems: Mac OS, Linux, Windows, Android, iOS.",
  "Головним недоліком формату JPEG можна вважати те, що картинки в цьому форматі можна ефективно обробляти тільки один раз. Після кожного збереження зображення втрачають якість і чим вище рівень стиснення, тим гірше буде їх якість.Іншим недоліком формату JPEG є те, що він не зберігає шари і альфа канали (прозорість).Обмеження формату, які безпосередньо залежать від рівня стиснення інформації:": "The main disadvantage of the JPEG format is that images in this format can be effectively processed only once. After each saving, the images lose quality, and the higher the compression level, the worse their quality will be. Another disadvantage of the JPEG format is that it does not preserve layers and alpha channels (transparency). These are format limitations that directly depend on the level of information compression:",
  "Спотворення кольору": "Color Distortion",
  "Мозаїчність": "Mosaic",
  "Ореоли навколо контурів": "Haze around contours",
  "Поява шумів": "Noise",
  "Втрата деталізації": "Loss of detail",
  "Ступінчастість ліній": "Steps in lines",
  "Погіршення різкості": "Sharpness degradation",
  "Детальніше про процес стиснення файлів у форматі JPEG": "Learn more about the JPEG file compression process",
  "Щоб дати вам уявлення про масштаб стиснення, яке використовується в цьому форматі, уявіть собі зображення вагою приблизно в 100 кілобайт. Якби інформація про зображення зберігалася без стиснення, для кожного пікселя треба було б три числа – по одному для кожного з червоного, зеленого і синього компонентів. Це буде означати в цілому 1 140 000 чисел, або близько 1,2 мегабайт. Завдяки стисненню JPEG вихідний файл стає в більш ніж десять разів меншим!Процес стиснення картинки в форматі JPEG проводиться не відразу, а поетапно.": "To give you an idea of the scale of compression used in this format, imagine an image weighing approximately 100 kilobytes. If the image information were stored uncompressed, each pixel would require three numbers - one for each of the red, green, and blue components. This would mean a total of 1,140,000 numbers, or about 1.2 megabytes. JPEG compression makes the original file more than ten times smaller! The process of compressing a JPEG image is not done all at once, but in stages.",
  "Існує 3 рівні стиснення які використовуються в JPEG": "There are 3 levels of compression used in JPEG",
  "Довжина циклу, дельта і кодування Гоффмана (Run-Length, Delta & Huffman Encoding)": "Run-Length, Delta & Huffman Encoding",
  "Дискретне косинусне перетворення і квантування (Discrete Cosine Transform and Quantization)": "Discrete Cosine Transform and Quantization",
  "Колірна субдискретизація (Chrominance Subsampling)": "Chrominance Subsampling",
  "В першу чергу цифрове зображення переводиться з колірного простору RGB в YCbCr. У ньому компонента Y відповідає за яскравість зображення, Cb – це відносна синява (relative blueness), Cr – це відносне почервоніння (relative redness). Останні 2 компонента кодуються повністю, і в них зменшується інформація про колір.Цей етап в деякій мірі схожий на те, як працюють людські очі. Кольорові рецептори в наших очах, відомі як «колбочки», діляться на три типи, кожен з яких найбільш чутливий до червоного, зеленого чи синього. Палички, інший тип рецептора, яким наші очі бачать, можуть виявляти тільки зміни яскравості, але вони набагато більш чутливі. У наших очах близько ста двадцяти мільйонів паличок в порівнянні з жалюгідними шістьма мільйонами колбочок.Це означає, що наші очі набагато краще виявляють зміни яскравості, ніж вони виявляють зміни кольору. Якщо ми можемо відокремити колір від яскравості, ми можемо видалити трохи кольору, щоб ніхто не помітив. Підвибірка насиченості кольору – це процес подання колірних компонентів зображення з більш низьким дозволом, ніж у його компонентів яскравості.Кожен піксель має рівно один компонент Y, тоді як кожна дискретна група з чотирьох пікселів має рівно один компонент Cb і один компонент Cr. Таким чином, зображення містить тільки чверть інформації про початковий колір.Використання колірного простору YCbCr не є унікальним для JPEG. Насправді, він був розроблений в 1938 році для телевізійних передач. Не у всіх були кольорові телевізори, тому відділення кольору від яскравості дозволило всім отримувати однакову передачу, а телевізори, які не підтримували колір, просто використовували компонент яскравості.": "First of all, a digital image is converted from the RGB color space to YCbCr. In it, the Y component is responsible for the brightness of the image, Cb is the relative blueness, and Cr is the relative redness. The last 2 components are fully encoded, and the color information is reduced. This stage is somewhat similar to how human eyes work. The color receptors in our eyes, known as \"cones,\" are divided into three types, each of which is most sensitive to red, green, or blue. Rods, the other type of receptor our eyes use to see, can only detect changes in brightness, but they are much more sensitive. There are about one hundred and twenty million rods in our eyes compared to a measly six million cones. This means that our eyes are much better at detecting changes in brightness than they are at detecting changes in color. If we can separate color from luminance, we can remove a little bit of color without anyone noticing. Color saturation subsampling is the process of representing the color components of an image at a lower resolution than its luminance components. Each pixel has exactly one Y component, while each discrete group of four pixels has exactly one Cb component and one Cr component. Thus, the image contains only a quarter of the information about the original color. The use of the YCbCr color space is not unique to JPEG. In fact, it was developed in 1938 for television broadcasts. Not everyone had color TVs, so separating color from luminance allowed everyone to receive the same transmission, and TVs that did not support color simply used the luminance component.",
  "На цьому етапі все зображення розбивається на окремі квадрати розміром 8×8 пікселів і над кожним з них відбувається перетворення. При цьому кожен квадрат розкладається на складові кольору для підрахунку частоти появи їх по всьому зображенню.Цей рівень стиснення в значній мірі є визначальною особливістю JPEG. Після перетворення кольорів в YCbCr компоненти стискаються окремо. Дискретне косинусне перетворення (Discrete Cosine Transform – DCT) – це процес розбиття зображення на блоки 8×8 і перетворення кожного блоку в комбінацію з 64 патернів.Звучить неймовірним те, що будь-яке зображення може бути представлене з використанням 64 особливих шаблонів (патернів). Але це те ж саме, що сказати, що будь-яке місце на Землі можна уявити з використанням тільки двох чисел: довготи і широти. Поверхню Землі можна представити як двовимірну, тому тут потрібні тільки два числа. Зображення 8х8 має шістдесят чотири виміри, тому нам потрібно шістдесят чотири числа.З точки зору стиснення, не очевидно, як це допомагає нам. Якщо нам потрібно шістдесят чотири числа для представлення зображення 8×8, чому це краще, ніж зберігати шістдесят чотири компонента яскравості? Ми робимо це з тієї ж причини, по якій ми перетворили три числа RGB в три числа YCbCr: це дозволяє нам видаляти деталі, які менш помітні.Важко зрозуміти, як саме виглядають деталі, які видаляються на цьому етапі стиснення, тому що JPEG застосовує дискретне косинусне перетворення тільки до блоків по 8×8 пікселів за один раз. Однак немає причин, за якими ми не можемо застосувати його до всього зображення.\nНа цьому етапі стиснення JPEG видаляє високочастотні деталі. Перетворення кольорів в коефіцієнти (патерни) DCT не є операцією з втратами. Це крок квантування здійснюється з втратами, при якому значення високої частоти, значення близькі до нуля або обидва, видаляються. Коли ви вибираєте нижче налаштування якості для зображення JPEG, це збільшує поріг для того, скільки з цих значень буде видалено, що призводить до меншого розміру файлу, але до більш «зернистого» зображення.Об’єм видаленої з файлу JPEG інформації під час такої обробки сильно залежить від зазначеного рівня стиснення, і чим він більший, тим гірше буде якість зображення. Таке зображення вже ніколи не можна буде повернути до первісного вигляду. Саме тому JPEG називається форматом стиснення з втратами якості. Розмір файлу після стиснення в порівнянні з вихідним файлом безпосередньо залежить від деталізації зображення і чим більше дрібних деталей, тим більше розмір файлу. Краще стискаються ті зображення, в яких менше шуму і більше плавних колірних переходів і переходів яскравості. Чим вище контраст, тим гірше стискається картинка.": "At this stage, the entire image is divided into separate squares of 8×8 pixels, and a transformation is performed on each of them. At the same time, each square is decomposed into its color components to calculate the frequency of their appearance throughout the image. This level of compression is largely the defining feature of JPEG. After converting colors to YCbCr, the components are compressed separately. Discrete Cosine Transform (DCT) is the process of dividing an image into 8×8 blocks and converting each block into a combination of 64 patterns. It sounds incredible that any image can be represented using 64 special patterns. But this is the same as saying that any place on Earth can be represented using only two numbers: longitude and latitude. The surface of the Earth can be represented as two-dimensional, so only two numbers are needed. An 8x8 image has sixty-four dimensions, so we need sixty-four numbers. In terms of compression, it's not obvious how this helps us. If we need sixty-four numbers to represent an 8×8 image, why is that better than storing sixty-four luminance components? We do this for the same reason we converted three RGB numbers to three YCbCr numbers: it allows us to remove details that are less visible. It's hard to know exactly what the details that are removed at this stage of compression look like because JPEG only applies the discrete cosine transform to blocks of 8×8 pixels at a time. However, there is no reason why we can't apply it to the entire image.\nAt this stage, JPEG compression removes high-frequency details. Converting colors to DCT coefficients (patterns) is not a lossy operation. It is a lossy quantization step in which high frequency values, values close to zero, or both, are removed. When you select a lower quality setting for a JPEG image, it increases the threshold for how much of these values are removed, resulting in a smaller file size but a more \"grainy\" image. The amount of information removed from a JPEG file during this processing strongly depends on the specified compression level, and the higher the level, the worse the image quality will be. Such an image can never be restored to its original form. That's why JPEG is called a lossy compression format. The size of the file after compression in comparison with the original file directly depends on the detail of the image, and the more small details, the larger the file size. Images with less noise and more smooth color and brightness transitions are better compressed. The higher the contrast, the worse the image is compressed.",
  "На цьому етапі стиснення кодуються кольори та яскравість зображення. При цьому зберігаються тільки відмінності 64-х піксельних квадратів, а вся однакова інформація видаляється. Потім результати такого кодування представляються числами, які теж стискаються за спеціальним алгоритмом.Всі етапи стиснення досі були з втратами. Цей останній етап, навпаки, без втрат. Він не видаляє будь-яку інформацію, але значно зменшує розмір файлу.Як відбувається стиснення, якщо не відсікається якась інформація?Подумайте про просте суцільне чорне зображення. JPEG використовує близько 5000 чисел, щоб представити його, але ми можемо зробити набагато краще. Як можна зробити це з найменшою кількістю байтів? Найменше, що можна придумати, це чотири байти: три для вказівки кольору і один для визначення кількості пікселів, що мають цей колір. Ідея виразити всі повторювані значення коротко таким способом називається кодуванням по довжині прогону. Це буде без втрат, тому що ми можемо відновити закодовані дані точно в тому вигляді, як це було раніше.Розмір файлу суцільного чорного зображення JPEG набагато більше, ніж чотири байти, тому що пам’ятайте, що в шарі DCT стиснення застосовується до блоків 8×8 одночасно. Тому, як мінімум, нам знадобиться один коефіцієнт DCT для кожного блоку в 64 пікселя. Нам потрібен тільки один, тому що замість збереження одного коефіцієнта DCT, за яким слідують 63 нуля для цього зображення, кодування по довжині прогону дозволяє нам просто зберегти одне число і сказати «інші дорівнюють нулю».Дельта-кодування – це метод зберігання кожного байта в якості відносного значення в порівнянні з чимось перед ним, замість збереження його абсолютного значення.Для цього етапу характерно те, що тут відбувається запис заголовків в JPEG. Заголовки – це перші близько 500 байтів, які містять метадані про зображення, такі як його ширина і висота. Без заголовка практично неможливо (або, принаймні, дуже важко) декодувати зображення JPEG. Кожне зображення JPEG стискається з кодом, який специфічний для цього конкретного зображення. Ці коди визначені в словнику, що зберігається в заголовку. Цей метод називається кодуванням Гаффмана, а словник (алфавіт) називається таблицею Гаффмана. Кожен компонент кольору може мати свою власну таблицю Гаффмана.Таблиці Гаффмана мають такий сильний вплив на зображення, оскільки вони говорять нам, як читати окремі біти. До цих пір ми мали справу з двійковими числами в десятковому вигляді. Це приховує той факт, що якщо ви хочете зберегти число 1 в байті, воно буде виглядати як 00000001, тому що кожен байт повинен мати рівно вісім бітів, навіть якщо йому потрібен тільки один біт.Це потенційно величезна трата сховища, якщо у вас багато невеликих номерів. Кодування Гаффмана – це метод, який дозволяє нам послабити цю вимогу про те, що кожне число має займати вісім бітів.": "At this stage of compression, the colors and brightness of the image are encoded. At the same time, only the differences of 64 pixel squares are preserved, and all identical information is removed. The results of this encoding are then represented by numbers, which are also compressed using a special algorithm. All the compression stages so far have been lossy. This last stage, on the contrary, is lossless. It doesn't remove any information, but it does significantly reduce the file size. How does compression work if no information is cut off? Think of a simple, solid black image. JPEG uses about 5000 numbers to represent it, but we can do much better. How can we do it with the fewest bytes? The smallest you can think of is four bytes: three to specify a color and one to define the number of pixels that have that color. The idea of expressing all repeated values in a short way in this way is called run-length coding. It is lossless because we can recover the encoded data exactly as it was before. The file size of a solid black JPEG image is much larger than four bytes, because remember that in the DCT layer, compression is applied to 8×8 blocks at a time. Therefore, at a minimum, we need one DCT coefficient for each 64-pixel block. We only need one because instead of storing one DCT coefficient followed by 63 zeros for this image, run-length coding allows us to simply store one number and say \"the rest are zero\". Delta coding is a method of storing each byte as a relative value compared to something before it, instead of storing its absolute value. This stage is characterized by the fact that headers are written to the JPEG. Headers are the first 500 bytes or so that contain metadata about the image, such as its width and height. Without a header, it is almost impossible (or at least very difficult) to decode a JPEG image. Each JPEG image is compressed with a code that is specific to that particular image. These codes are defined in a dictionary stored in the header. This method is called Huffman coding, and the dictionary (alphabet) is called a Huffman table. Each color component can have its own Huffman table. The Huffman tables have such a strong influence on the image because they tell us how to read the individual bits. So far, we've been dealing with binary numbers in decimal form. This hides the fact that if you want to store the number 1 in a byte, it will look like 00000001 because each byte must have exactly eight bits, even if it only needs one bit. This is potentially a huge waste of storage if you have a lot of small numbers. Huffman encoding is a method that allows us to relax this requirement that each number must take up eight bits.",
  "З огляду на всі переваги і недоліки файлового формату JPEG, які ми розглянули вище, ви зможете ефективно зберігати зображення в цьому форматі. Це дозволить вам заощадити дисковий простір на комп’ютері і при цьому зберегти високу якість зображень.Багато фотографів роблять основну помилку: фотографії інших, більш «важких» графічних форматів, для економії місця переводять в формат JPEG, обробляють кілька разів і при цьому ще сильно стискають. Все це можна робити тільки з копіями фотографій. Не забувайте, що формат JPEG призначений в основному для ефективного перегляду зображень, а не для наступних обробок і доопрацювань.Якщо ви робите фотографії у форматі JPEG, а потім хочете їх якісно обробити, тоді спочатку їх слід перевести в формат PSD або TIFF. Ці формати матимуть великий розмір, але зате у них не буде тих недоліків, які притаманні файлам JPEG. Тільки після остаточного завершення обробки фотографії ви можете зберегти її у форматі JPEG.Для поліпшення якості фотографій в форматі JPEG, при збереженні завжди встановлюйте колірний профіль sRGB. Цей профіль підтримується всіма графічними програмами, всіма технічними пристроями і на всіх платформах. В результаті ваші фотографії будуть виглядати скрізь однаково.": "Considering all the advantages and disadvantages of the JPEG file format that we discussed above, you can effectively store images in this format. This will allow you to save disk space on your computer and at the same time maintain high image quality.Many photographers make a basic mistake: photos of other, more \"heavy\" graphic formats are converted to JPEG format to save space, processed several times and still heavily compressed. All this can only be done with copies of photos. Don't forget that the JPEG format is designed primarily for efficient image viewing, not for subsequent processing and refinement. If you take photos in JPEG format and then want to process them qualitatively, then you should first convert them to PSD or TIFF format. These formats will have a larger size, but they will not have the disadvantages that are inherent in JPEG files. Only after the photo is finally processed can you save it in JPEG format. To improve the quality of JPEG photos, always set the color profile to sRGB when saving them. This profile is supported by all graphics programs, all technical devices, and all platforms. As a result, your photos will look the same everywhere.",
  "Формат PNG є ефективним рішенням для зберігання зображень з прозорістю, градієнтами та текстурами, оскільки він дозволяє точно відтворити ці елементи без втрати якості. При використанні формату PNG важливо враховувати розмір файлу. Завдяки безвтратному стисненню, PNG-зображення можуть бути більшими, ніж їх еквіваленти у форматі JPEG. Тому, якщо розмір файлу є критичним фактором, можливо, слід розглянути інші формати зображень.\n\nКрім того, важливо використовувати відповідний тип PNG в залежності від ваших потреб. PNG-8 є ідеальним варіантом для зображень з обмеженою палітрою кольорів, таких як іконки або маленькі анімаційні файли. PNG-24 забезпечує повний колірний спектр і використовується для зображень з багатими деталями та градієнтами. PNG-32 є розширенням PNG-24 і додає підтримку альфа-каналу для прозорості.Загалом, вибір правильного формату зображення, зокрема PNG, залежить від вашої конкретної ситуації. Розгляньте потреби вашого проекту, тип контенту та критерії якості зображення, щоб визначити, чи відповідає формат PNG вашим вимогам.": "The PNG format is an effective solution for storing images with transparency, gradients, and textures because it allows you to accurately reproduce these elements without losing quality. When using the PNG format, it is important to consider the file size. Thanks to lossless compression, PNG images can be larger than their JPEG equivalents. Therefore, if file size is a critical factor, you may want to consider other image formats.\n\nIn addition, it is important to use the appropriate PNG type depending on your needs. PNG-8 is ideal for images with a limited color palette, such as icons or small animated files. PNG-24 provides the full color spectrum and is used for images with rich details and gradients. PNG-32 is an extension of PNG-24 and adds support for the alpha channel for transparency.Overall, choosing the right image format, particularly PNG, depends on your specific situation. Consider your project needs, content type, and image quality criteria to determine if the PNG format meets your requirements.",
  "Додатково, формат PNG має кілька варіацій: PNG-8: Це варіант PNG, який використовує індексовану колірну палітру, обмежену до 256 кольорів. Він дозволяє зберігати зображення з використанням меншої кількості даних, що корисно для маленьких анімаційних файлів або іконок. PNG-24: Це повна кольорова версія PNG, яка використовує 24-бітовий колірний простір RGB. Вона зберігає кожен піксель у своєму точному значенні кольору, забезпечуючи високу якість зображення. PNG-32: Це варіант PNG, який додатково підтримує альфа-канал. Він дозволяє встановлювати прозорість для кожного пікселя зображення, що дає більшу гнучкість при створенні графічних ефектів та накладанні зображень. Зазначена гнучкість і підтримка прозорості роблять формат PNG популярним в графічному дизайні, веб-розробці, створенні логотипів, іконок та ілюстрацій. Однак, варто враховувати, що через безвтратне стиснення, файли PNG можуть бути більшими за розміром, ніж файли JPEG, особливо для фотографій. Узагальнюючи, формат PNG є важливим інструментом для зберігання зображень з високою якістю, підтримкою прозорості та точною передачею кольорів. Він забезпечує широку сумісність з браузерами і застосовується в різних галузях": "Additionally, the PNG format has several variations: PNG-8: This is a variant of PNG that uses an indexed color palette limited to 256 colors. It allows you to store images using less data, which is useful for small animation files or icons. PNG-24: This is a full color version of PNG that uses the 24-bit RGB color space. It stores each pixel in its exact color value, providing high image quality. PNG-32: This is a variant of PNG that additionally supports the alpha channel. It allows you to set the transparency for each pixel of the image, which gives you more flexibility when creating graphic effects and image overlays. This flexibility and support for transparency make the PNG format popular in graphic design, web development, and the creation of logos, icons, and illustrations. However, you should keep in mind that due to lossless compression, PNG files can be larger than JPEG files, especially for photos. To summarize, the PNG format is an important tool for storing images with high quality, transparency, and accurate color reproduction. It provides wide compatibility with browsers and is used in various industries.",
  "PNG (Portable Network Graphics) - це формат зображення, який широко використовується в Інтернеті та графічних додатках. На відміну від інших популярних форматів, таких як JPEG і GIF, PNG використовує безвтратне стиснення, що означає, що воно зберігає всю інформацію про зображення без втрати якості. Нижче наведено докладну інформацію про формат PNG: Безвтратне стиснення: Формат PNG використовує алгоритми безвтратного стиснення даних, такі як Deflate, для зменшення розміру файлу без втрати якості зображення. Це означає, що кожен піксель зберігається точно, і ви не втрачаєте деталей при стисненні. Підтримка прозорості: Однією з важливих особливостей формату PNG є його здатність до підтримки прозорості. Зображення у форматі PNG можуть мати альфа-канал, що дозволяє встановлювати прозорість для окремих пікселів. Це особливо корисно для створення графіки з прозорим фоном або накладання зображень одне на одне. Висока точність передачі кольору: PNG підтримує 24-бітовий колірний простір, що означає, що він може відтворювати багато кольорів і деталей у зображеннях. Він зберігає кольори без втрати якості і дозволяє точну передачу кольорів у порівнянні з форматом JPEG, який використовує стиснення з втратами. Масова підтримка браузерами: Формат PNG підтримується всіма сучасними веб-браузерами, що робить його ідеальним для використання в веб-розробці. Це означає, що ви можете впевнено використовувати зображення у форматі PNG на своєму веб-сайті, знаючи, що вони будуть відображатись на будь-якому браузері без проблем.": "PNG (Portable Network Graphics) is an image format that is widely used on the web and in graphic applications. Unlike other popular formats such as JPEG and GIF, PNG uses lossless compression, which means it retains all image information without losing quality. Below is more information about the PNG format: Lossless compression: The PNG format uses lossless data compression algorithms, such as Deflate, to reduce the file size without losing image quality. This means that every pixel is preserved accurately and you don't lose any detail during compression. Transparency support: One of the important features of the PNG format is its ability to support transparency. PNG images can have an alpha channel, which allows you to set transparency for individual pixels. This is especially useful for creating graphics with transparent backgrounds or overlaying images on top of each other. High color accuracy: PNG supports a 24-bit color space, which means it can reproduce many colors and details in images. It preserves colors without loss of quality and allows for accurate color reproduction compared to JPEG, which uses lossy compression. Massive browser support: The PNG format is supported by all modern web browsers, making it ideal for use in web development. This means that you can confidently use PNG images on your website knowing that they will be displayed on any browser without any problems.",
  "Кафедра комп'ютерних систем та мереж": "Department of Computer Systems and Networks",
  "Назва дисципліни: \"Мультимедійні засоби в комп'ютерних системах\"": "Name of the discipline: \"Multimedia in computer systems\"",
  "Тема МЕ: \"Формати мультимедії, які можуть бути записані через браузер\"": "ME topic: \"Multimedia formats that can be recorded through a browser\"",
  "Виконав Кашуба І.Ф., 2023рік": "Performed by Kashuba I.F., 2023",
  "Що таке файл GIF?": "What is a GIF file?",
  "Формат файлу GIF": "GIF file format",
  "Заголовок": "Title",
  "Дескриптор логічного екрана": "Logic screen descriptor",
  "Загальна таблиця кольорів": "General color chart",
  "GIF або Graphical Interchange Format — це тип сильно стиснутого зображення. GIF, що належить Unisys, використовує алгоритм стиснення LZW, який не погіршує якість зображення. Для кожного зображення GIF зазвичай допускається до 8 біт на піксель і до 256 кольорів у всьому зображенні. На відміну від зображення JPEG, яке може відображати до 16 мільйонів кольорів і доторкається до меж людського ока. Коли з’явився Інтернет, GIF-файли залишалися найкращим вибором, оскільки вони потребували низької пропускної здатності та були сумісні з графікою, яка споживає суцільні кольорові області. Анімований GIF поєднує численні зображення або кадри в один файл і відображає їх у послідовності для створення анімованого кліпу або короткого відео. Кольорові обмеження становлять до 256 для кожного кадру, і вони, імовірно, найменше підходять для відтворення інших зображень і фотографій із градієнтом кольорів.": "GIF or Graphical Interchange Format is a type of highly compressed image. GIF, owned by Unisys, uses the LZW compression algorithm, which does not degrade image quality. Each GIF image is typically allowed up to 8 bits per pixel and up to 256 colors in the entire image. Unlike a JPEG image, which can display up to 16 million colors and touches the limits of the human eye. When the Internet came along, GIFs were still the best choice because they required low bandwidth and were compatible with graphics that consume solid color areas. An animated GIF combines numerous images or frames into a single file and displays them in a sequence to create an animated clip or short video. The color limit is up to 256 per frame, and it's probably the least suitable for playing other images and photos with a color gradient.",
  "Концептуально GIF-файли мають графічну область фіксованого розміру, заповнену нулем або більше зображеннями. Деякі файли GIF поділяють графічну область або блоки фіксованого розміру на підзображення, здатні функціонувати як анімовані кадри у випадку анімованого GIF. Формат GIF використовує глибину пікселів від 1 до 8 біт для зберігання растрових даних. Колірна модель RGB і дані палітри завжди використовуються для зберігання зображень. Залежно від версії заголовок фіксованої довжини (“GIF87a” або “GIF89a”) визначає початок типового файлу GIF.Наразі доступні дві версії GIF: 87a та 89a. Перший — вихідний формат GIF, а другий — новий формат GIF. У цьому форматі файлу характеристики блоків і розміри пікселів згадуються в логічному дескрипторі екрана фіксованої довжини. Існування та розмір глобальної таблиці кольорів може бути визначено дескриптором екрану, який відстежує додаткові деталі, якщо вони присутні. Трейлер — це останній байт файлу, який містить один байт крапки з комою ASCII.": "Conceptually, GIFs have a fixed-size graphic area filled with zero or more images. Some GIF files divide the fixed-size graphic area or blocks into sub-images that can function as animated frames in the case of an animated GIF. The GIF format uses a pixel depth of 1 to 8 bits to store raster data. The RGB color model and palette data are always used to store images. Depending on the version, a fixed-length header (\"GIF87a\" or \"GIF89a\") defines the beginning of a typical GIF file. There are currently two versions of GIF available: 87a and 89a. The first is the original GIF format, and the second is the new GIF format. In this file format, block characteristics and pixel sizes are mentioned in a fixed-length logical screen descriptor. The existence and size of the global color table can be determined by the screen descriptor, which keeps track of additional details, if present. A trailer is the last byte of a file that contains a single byte of ASCII semicolon.",
  "Заголовок містить шість байтів і використовується для визначення типу файлу як GIF. Хоча дескриптор логічного екрана відокремлений від фактичного заголовка, іноді його вважають другим заголовком. Така сама структура, яка використовується для зберігання заголовка, може зберігати дескриптор логічного екрана. Усі GIF-файли починаються з 3-байтового підпису та використовують символи «GIF» як ідентифікатор. Версія також має розмір у три байти та оголошує версію файлу GIF.": "The header contains six bytes and is used to identify the file type as GIF. Although the logical screen descriptor is separate from the actual header, it is sometimes considered a second header. The same structure used to store the title can store the logical screen descriptor. All GIFs start with a 3-byte signature and use the characters \"GIF\" as an identifier. The version is also three bytes in size and declares the version of the GIF file.",
  "Дескриптор зображення фіксованої довжини визначає інформацію про екран і колір, необхідну для створення зображення GIF. Поля Height і Width містять найменше значення роздільної здатності екрана, обов’язкове для відображення даних зображення. Якщо пристрій відображення не в змозі відобразити вказану роздільну здатність, для відповідного відображення зображення знадобиться масштабування. Інформація про екран і колірну карту відображається чотирма підполями таблиці нижче (тоді як біт 0 є молодшим бітом)": "A fixed-length image descriptor specifies the screen and color information needed to create a GIF image. The Height and Width fields contain the smallest screen resolution value required to display the image data. If the display device is not capable of displaying the specified resolution, scaling is required to display the image appropriately. The screen and color map information is displayed in the four subfields of the table below (with bit 0 being the lowest bit)",
  "Додаткова таблиця глобальних кольорів розміщується одразу після дескриптора логічного екрана. Ця таблиця зіставлена для індексування даних кольору пікселів у даних зображення. За відсутності глобальної таблиці кольорів кожне зображення у файлі GIF використовує свій локальний колір. Краще надати таблицю кольорів за замовчуванням, якщо відсутні глобальна та локальна таблиця кольорів. Серія трибайтових трійок складає елементи таблиці кольорів. Кожен байт характеризує значення кольору RGB. Червоний, зелений і синій кольори використовуються як значення кожного елемента таблиці кольорів. Записи в глобальній таблиці кольорів охоплюють максимум 256 записів і завжди відображаються у ступені двох.": "An additional global color table is placed immediately after the logical screen descriptor. This table is mapped to index the pixel color data in the image data. In the absence of a global color table, each image in a GIF file uses its own local color. It's best to provide a default color table if you don't have a global and local color table. A series of three-byte triples make up the elements of a color table. Each byte represents an RGB color value. Red, green, and blue are used as the values of each color table element. The entries in the global color table span a maximum of 256 entries and are always displayed in powers of two.",
  "Протягом останніх 25 років JPEG був найбільш широко підтримуваним форматом для інтернет графіки. JPEG є форматом стиснення із втратами. Хоча швидкість декодування файлів JPEG є відмінною, їй не вистачає інших функцій, необхідних для зображень на сучасних веб-сайтах. JPEG не підтримує прозорість зображень, анімації, карти глибини кольору або можливість накладання шарів. JPEG найкраще працює із фотографіями. PNG є форматом без втрат і може підтримувати альфа-прозорість, але досягнуте стиснення, особливо для фотографій, значно нижче. JPEG та PNG широко використовуються в залежності від типу потрібного зображення.Таким чином, метою сучасних форматів зображень є подолання обмежень JPEG та PNG, пропонуючи найкраще стиснення та гнучкість для підтримки інших сучасних функцій. Зважаючи на таку необхідність і виникли формати WEBP та AVIF, які зараз активно впроваджуються на різних сайтах.": "For the past 25 years, JPEG has been the most widely supported format for web graphics. JPEG is a lossy compression format. Although the decoding speed of JPEG files is excellent, it lacks other features required for images on modern websites. JPEG does not support image transparency, animation, color depth maps, or the ability to layer. JPEG works best with photos. PNG is a lossless format and can support alpha transparency, but the compression achieved, especially for photos, is much lower. JPEG and PNG are widely used depending on the type of image required. Thus, the goal of modern image formats is to overcome the limitations of JPEG and PNG by offering the best compression and flexibility to support other modern features. Due to this need, the WEBP and AVIF formats have emerged and are now being actively implemented on various websites.",
  "Необхідність у нових форматах": "The need for new formats",
  "Ступінь стиску": "Compression ratio",
  "Підтримка браузерами": "Support by browsers",
  "Порівняння": "Comparison",
  "Формат WEBP був створений Google у 2011 році як формат зображень, який допоможе зробити Інтернет швидше. За минулі роки він набув широкого поширення через його здатність стискати зображення до файлів меншого розміру порівняно з JPEG та PNG. WEBP пропонує стиснення без втрат і з втратами з прийнятною візуальною якістю та підтримує прозорість та анімацію альфа-каналу.Зображення WEBP без втрат зазвичай на третину менше, ніж PNG, а зображення WEBP із втратами на 40 відсотків менше, ніж зображення JPEG аналогічної якості. Підтримка анімації також робить їх чудовою заміною зображень у форматі GIF.Для порівняння нижче представлені два фото у різних форматах: ліворуч стандартний JPG, праворуч новий формат WEBP.": "The WEBP format was created by Google in 2011 as an image format that would help make the Internet faster. Over the years, it has become widely used because of its ability to compress images to smaller files compared to JPEG and PNG. WEBP offers lossless and lossy compression with acceptable visual quality and supports transparency and alpha channel animation. A lossless WEBP image is typically 30% smaller than a PNG, and a lossy WEBP image is 40% smaller than a JPEG image of similar quality. Support for animation also makes them a great replacement for GIF images. For comparison, below are two photos in different formats: on the left is a standard JPG, on the right is the new WEBP format.",
  "Крім хорошого стиснення, WEBP має інші незаперечні переваги, такі як": "In addition to good compression, WEBP has other undeniable advantages, such as:",
  "Прозорість - WEBP має 8-бітний канал прозорості без втрат, у якому лише на 22% більше байтів, ніж у PNG. Він також підтримує прозорість RGB із втратами, що є унікальною функцією WEBP.": "Transparency - WEBP has an 8-bit lossless transparency channel with only 22% more bytes than PNG. It also supports lossy RGB transparency, which is a unique feature of WEBP.",
  "Додаткові метадані - Формат файлу WEBP підтримує метадані фотографій EXIF ​​та метадані цифрових документів Extensible Metadata Platform (XMP). Він також може містити колірний профіль ICC.": "Additional metadata - The WEBP file format supports EXIF photo metadata and Extensible Metadata Platform (XMP) digital document metadata. It can also contain the ICC color profile.",
  "Анімація - Формат WEBP підтримує повнокольорові анімовані зображення.": "Animation - The WEBP format supports full-color animated images.",
  "За останні пару років різні інтернет-браузери та програми стали підтримувати WEBP і розробили безліч інструментів для створення, перегляду та завантаження файлів WEBP. Сьогодні WEBP підтримується в останніх версіях майже всіх основних браузерів.": "Over the past couple of years, various Internet browsers and programs have begun to support WEBP and have developed many tools for creating, viewing, and downloading WEBP files. Today, WEBP is supported in the latest versions of almost all major browsers.",
  "Якщо розробники захочуть використовувати WEBP на своїх сайтах, вони можуть це зробити за допомогою елемента як показано нижче. Таким чином, якщо браузер не підтримує новий формат, то замість нього відобразить зображення у форматі JPG.": "If developers want to use WEBP on their websites, they can do it with the help of the element as shown below. This way, if the browser does not support the new format, it will display a JPG image instead.",
  "CDN також підтримують адаптивні зображення з автоматичним вибором формату для зображень WEBP або AVIF залежно від підтримки браузера. Плагіни WEBP доступні для інших популярних CMS, таких як WordPress, Joomla, Drupal та ін. Початкова підтримка WEBP також доступна у самому ядрі WordPress, починаючи з версії 5.8.": "CDNs also support responsive images with automatic format selection for WEBP or AVIF images depending on browser support. WEBP plugins are available for other popular CMS such as WordPress, Joomla, Drupal, etc. Initial support for WEBP is also available in the WordPress core itself, starting with version 5.8.",
  "Спочатку істотним недоліком WEBP була відсутність підтримки браузера і належного інструментарію. При розгляді всіх функцій, які в ідеалі має підтримувати сучасний формат, як і раніше, є кілька суттєвих зауважень.": "Initially, a significant drawback of WEBP was the lack of browser support and proper tools. When considering all the functions that a modern format should ideally support, there are still several significant comments.",
  "WEBP обмежений 8-бітною точністю кольору. В результаті він не може підтримувати зображення HDR/з широкою гамою кольорів.": "WEBP is limited to 8-bit color accuracy. As a result, it cannot support HDR/wide color gamut images.",
  "WEBP не підтримує зображення із втратами кольору. Це може вплинути на зображення із дрібними деталями, хроматичними текстурами або кольоровим текстом.": "WEBP does not support images with color loss. This may affect images with fine details, chromatic textures, or colored text.",
  "Формат не підтримує прогресивне декодування. В ідеалі ви можете створювати файли WEBP із доступних вихідних файлів найвищої якості. Перетворення неякісних файлів JPEG на файли WEBP не дуже ефективно, оскільки стискається двічі.": "The format does not support progressive decoding. Ideally, you should create WEBP files from the highest quality source files available. Converting low-quality JPEG files to WEBP files is not very efficient because they are compressed twice.",
  "Cтупінь стиснення фотографічних та нефотографічних зображень може також відрізнятися залежно від точності (якості) зображень. Тут ми зазначили загальний бал. Загалом формат WEBP краще підтримує та пропонує краще стиснення порівняно з JPEG або PNG. Таким чином, застосовувати новий формат на сайті можна, але з обережністю, тому що він підтримується далеко не всіма браузерами.": "The compression rate of photographic and non-photographic images may also vary depending on the accuracy (quality) of the images. Here we have indicated the overall score. In general, the WEBP format is better supported and offers better compression than JPEG or PNG. Thus, you can use the new format on your website, but with caution, because it is not supported by all browsers.",
  "Формат Portable Network Graphics (PNG) був розроблений у 1995 році як універсальний замінник формату GIF. Він є форматом стиснення зображень без втрат, що означає, що якість зображення зберігається при стисканні.Однією з основних переваг PNG є можливість використання прозорості. Оскільки формат PNG зберігає інформацію про прозорість, він стає дуже зручним для створення та використання зображень із прозорими фонами. Крім того, PNG може використовуватися для створення зображень із альфа-каналом, який дозволяє робити зображення напівпрозорими.Однією з особливостей формату PNG є його здатність зберігати зображення у форматі TrueColor з палітрою 24 біт на піксель. Це означає, що PNG може зберігати широкий діапазон кольорів, ніж формат GIF, який використовує всього 8 біт на піксель.Формат PNG також може зберігати метадані, такі як інформацію про авторське право, ключові слова і т.д. Це робить його дуже зручним для використання веб-дизайнерами та іншими професійними користувачами.Незважаючи на ці переваги, формат PNG не підходить для всіх випадків. Зображення у форматі PNG можуть займати більше місця на диску, ніж зображення у форматі JPEG, що робить його менш придатним для зберігання великих зображень або зображень з високою роздільною здатністю. Крім того, PNG не підтримує анімацію на відміну від формату GIF.Деякі програми можуть мати проблеми з відображенням зображень у форматі PNG, особливо якщо вони не оновлюють бібліотеки форматів файлів. Крім того, PNG може бути більш витратним для обробки, ніж деякі інші формати.Загалом формат PNG є дуже зручним і гнучким форматом для зберігання зображень. Він може використовуватися в різних областях, від веб-дизайну до графічного дизайну. Однак перед використанням PNG необхідно переконатися, що цей формат підходить для конкретного завдання, оскільки він може мати свої обмеження та недоліки.Для відкриття файлів у форматі PNG необхідно використовувати програмне забезпечення, яке підтримує цей формат. У комп'ютерних операційних системах Windows та macOS установка простого переглядача зображень, такого як Windows Photo Viewer або Preview, зазвичай дозволяє відкривати файли у форматі PNG.Також існує багато програм для редагування зображень, які підтримують формат PNG. Деякі з найпопулярніших програм у цій галузі включають Adobe Photoshop, GIMP, Paint.NET та Inkscape.Якщо потрібно конвертувати файл з іншого формату в PNG, ви можете використовувати спеціалізовані програми для конвертації зображень, такі як XnConvert, Format Factory або Online-Convert.Загалом, для відкриття файлів у форматі PNG вам потрібно встановити відповідне програмне забезпечення або використовувати онлайн-конвертери, якщо потрібно зробити конвертацію у цей формат.": "The Portable Network Graphics (PNG) format was developed in 1995 as a universal substitute for the GIF format. It is a lossless image compression format, which means that the image quality is preserved during compression. One of the main advantages of PNG is the ability to use transparency. Since the PNG format preserves transparency information, it becomes very convenient for creating and using images with transparent backgrounds. In addition, PNG can be used to create images with an alpha channel, which allows you to make images translucent. One of the features of the PNG format is its ability to store images in TrueColor format with a palette of 24 bits per pixel. This means that PNG can store a wider range of colors than the GIF format, which uses only 8 bits per pixel. The PNG format can also store metadata such as copyright information, keywords, etc. This makes it very convenient for web designers and other professional users. Despite these advantages, the PNG format is not suitable for all cases. PNG images can take up more disk space than JPEG images, making it less suitable for storing large or high-resolution images. In addition, PNG does not support animation, unlike the GIF format. Some applications may have trouble displaying PNG images, especially if they don't keep their file format libraries up to date. In addition, PNG can be more expensive to process than some other formats. In general, the PNG format is a very convenient and flexible format for storing images. It can be used in a variety of areas, from web design to graphic design. However, before using PNG, you need to make sure that this format is suitable for a particular task, as it may have its limitations and drawbacks. To open PNG files, you need to use software that supports this format. On Windows and macOS computer operating systems, installing a simple image viewer such as Windows Photo Viewer or Preview usually allows you to open PNG files. There are also many image editing programs that support the PNG format. Some of the most popular programs in the field include Adobe Photoshop, GIMP, Paint.NET, and Inkscape. If you need to convert a file from another format to PNG, you can use specialized image conversion programs such as XnConvert, Format Factory, or Online-Convert. In general, you need to install the appropriate software to open PNG files or use online converters if you need to convert to this format.",
  "getUserMedia (MediaDevices.getUserMedia) є API веб-переглядача, яке дозволяє веб-додаткам отримувати доступ до медіа пристроїв користувача, таких як камера та мікрофон. Це дає можливість отримувати стріми аудіо та відео з цих пристроїв, щоб використовувати їх для зйомки відео, розпізнавання обличчя, звукового вводу та інших сценаріїв веб-додатків.За допомогою getUserMedia, веб-додатки можуть запитати в користувача дозвіл на доступ до камери та мікрофона пристрою. Якщо користувач надає дозвіл, то додаток може отримувати медіа стріми та працювати з ними.Це дозволяє створювати веб-додатки, які можуть проводити відеоконференції, реалізовувати фотозйомку через камеру, розпізнавати обличчя, записувати аудіо, використовувати аналіз звуку та багато інших мультимедійних функцій.Однак важливо пам'ятати, що доступ до медіа пристроїв, як камери та мікрофона, потребує дозволу користувача. Користувач має можливість надати або відхилити доступ до своїх медіа пристроїв під час використання веб-додатку.": "getUserMedia (MediaDevices.getUserMedia) is a browser API that allows web applications to access a user's media devices, such as a camera and microphone. This makes it possible to receive audio and video streams from these devices to use them for video capture, face recognition, audio input, and other web application scenarios. With getUserMedia, web applications can ask the user for permission to access the device's camera and microphone. If the user grants permission, the application can receive media streams and work with them. This allows you to create web applications that can conduct video conferencing, take photos through the camera, recognize faces, record audio, use sound analysis, and many other multimedia functions. However, it is important to remember that access to media devices such as cameras and microphones requires user permission. The user has the option to grant or deny access to their media devices when using the web application.",
  "Запис відео у браузері здійснюється за допомогою формату WEBM, відеофайл може конвертуватись в інші формати, такі як MP4 або Ogg, але спочатку він записується тільки з розширенням WEBM. Займатись записом медіа файлів через браузер позволяє інструмент UserMedia.": "Video recording in the browser is performed using the WEBM format, the video file can be converted to other formats such as MP4 or Ogg, but initially it is recorded only with the WEBM extension. The UserMedia tool allows you to record media files through the browser.",
  "WebM є відео кодеком, який використовується для стиснення відео з метою зменшення розміру файлу і підвищення швидкості передачі в мережі Інтернет. Він використовує відкритий кодек відео VP8 та відкритий кодек аудіо Vorbis, що робить його доступним для використання безкоштовно та без обмежень.WebM підтримує високу якість відео та звуку з мінімальними втратами якості відносно оригінального відео. Крім того, він підтримує багатофайловий контейнер, що дозволяє зберігати відео та аудіо дані в одному файлі.WebM є відкритим форматом, тобто його розробка відбувається в рамках відкритої групи, яка складається з представників різних компаній та організацій. Це дозволяє розробляти формат шляхом співпраці та взаємодії громадськості, що підвищує його розповсюдження та розвиток.WebM є популярним форматом для відео на веб-сайтах та підтримується більшістю веб-браузерів, таких як Google Chrome, Mozilla Firefox, Microsoft Edge та інші.": "WebM is a video codec used to compress video in order to reduce file size and increase the speed of transmission on the Internet. It uses the open source VP8 video codec and the open source Vorbis audio codec, which makes it available for use free of charge and without restrictions. WebM supports high quality video and audio with minimal quality loss relative to the original video. In addition, it supports a multi-file container that allows you to store video and audio data in a single file. WebM is an open format, meaning that its development takes place within an open group consisting of representatives of various companies and organizations. This allows the format to be developed through collaboration and public interaction, which increases its distribution and development. WebM is a popular format for video on websites and is supported by most web browsers, such as Google Chrome, Mozilla Firefox, Microsoft Edge, and others.",
  "Основні характеристики": "Main characteristics",
  "Компресія відео: WebM використовує відеокодек VP8 або VP9 для стиснення відео. Ці кодеки забезпечують ефективну стискаючу алгоритміку, що дозволяє знизити розмір відеофайлу без значної втрати якості.": "Video compression: WebM uses the VP8 or VP9 video codec to compress video. These codecs provide efficient compression algorithms that reduce the size of the video file without significant loss of quality.",
  "Компресія аудіо: WebM використовує аудіокодек Opus або Vorbis для стиснення аудіо. Ці кодеки забезпечують високу якість звуку при мінімальному розмірі файлу.": "Audio Compression: WebM uses the Opus or Vorbis audio codec to compress audio. These codecs provide high sound quality with minimal file size.",
  "Контейнер: WebM визначає структуру контейнера файлів, яка об'єднує відео та аудіо дані в один файл. Цей контейнер забезпечує синхронізацію відео та аудіо шляхів, що дозволяє відтворювати їх одночасно.": "Container: WebM defines a file container structure that combines video and audio data into a single file. This container keeps the video and audio paths synchronized so that they can be played simultaneously.",
  "Висока якість та ефективність: WebM забезпечує високу якість відео при зменшеному об'ємі файлу. Це робить його особливо корисним для потокової передачі відео в мережі з обмеженими пропускною здатністю та ресурсами.": "High quality and efficiency: WebM delivers high quality video with a reduced file size. This makes it especially useful for streaming video on a network with limited bandwidth and resources.",
  "Підтримка веб-технологій: WebM підтримується браузерами, що базуються на веб-стандартах, таких як HTML5. Це дозволяє безпосередньо відтворювати відеофайли WebM в браузерах без необхідності встановлення додаткових плагінів або кодеків.": "Support for web technologies: WebM is supported by browsers based on web standards such as HTML5. This allows WebM video files to be played directly in browsers without the need for additional plug-ins or codecs.",
  "Високоякісне стиснення відео: WebM використовує ефективні відеокодеки, такі як VP8 і VP9, для стиснення відеофайлів без значної втрати якості. Це дозволяє отримувати відео високої роздільної здатності з меншим розміром файлів, що полегшує їх зберігання та передачу через Інтернет.": "High-quality video compression: WebM uses efficient video codecs like VP8 and VP9 to compress video files without significant loss in quality. This allows for high-resolution videos with smaller file sizes, making them easier to store and transmit over the internet.",
  "Відкритий і безкоштовний: WebM - це відкритий і безкоштовний формат, що означає, що будь-хто може використовувати його без необхідності сплачувати ліцензійні платежі. Це сприяє широкому розповсюдженню та доступності на різних платформах і пристроях.": "Open and royalty-free: WebM is an open and royalty-free format, meaning that anyone can use it without having to pay licensing fees. This encourages widespread adoption and accessibility across different platforms and devices.",
  "Широка підтримка браузерів: Більшість сучасних веб-браузерів, включаючи Chrome, Firefox та Opera, підтримують WebM нативно. Це дозволяє безперешкодно відтворювати WebM-відео без додаткових плагінів або встановлення програмного забезпечення.": "Wide browser support: Most modern web browsers, including Chrome, Firefox, and Opera, support WebM natively. This enables seamless playback of WebM videos without requiring additional plugins or software installations.",
  "Ефективна трансляція: WebM оптимізовано для потокового передавання через Інтернет, що робить його ідеальним для доставки відеоконтенту в режимі реального часу. Він підтримує адаптивне потокове передавання, що дозволяє регулювати якість відео залежно від інтернет-з'єднання глядача, забезпечуючи плавне відтворення.": "Efficient streaming: WebM is optimized for streaming over the internet, making it ideal for delivering video content in real-time. It supports adaptive streaming, allowing the video quality to adjust based on the viewer's internet connection, ensuring smooth playback.",
  "Підтримка прозорості та альфа-каналів: WebM підтримує прозорість і альфа-канали, а це означає, що він може обробляти відео з прозорим фоном або ефектами накладання. Це робить його придатним для таких застосувань, як відеомонтаж, композитинг та анімація.": "Transparency and alpha channel support: WebM supports transparency and alpha channels, which means it can handle videos with transparent backgrounds or overlay effects. This makes it suitable for applications such as video editing, compositing, and animations.",
  "Широка сумісність платформ: WebM можна відтворювати на різних платформах, включаючи настільні комп'ютери, мобільні пристрої та вбудовані системи. Це забезпечує гнучкість для розробників і творців контенту для доставки відеоконтенту на широкий спектр пристроїв і операційних систем." : "Wide platform compatibility: WebM can be played on various platforms, including desktop computers, mobile devices, and embedded systems. It provides flexibility for developers and content creators to deliver video content across a wide range of devices and operating systems.",
  "Інтеграція з HTML5: WebM тісно інтегрований з HTML5, стандартною мовою розмітки веб-контенту. Його можна легко вбудувати у веб-сторінки за допомогою відеотегів HTML5, що забезпечує безперешкодну інтеграцію та відтворення без необхідності використання сторонніх плагінів.": "Integration with HTML5: WebM is closely integrated with HTML5, the standard markup language for web content. It can be easily embedded in web pages using HTML5 video tags, allowing for seamless integration and playback without the need for third-party plugins.",
  "Обмежена апаратна підтримка: Деякі старі або менш поширені апаратні пристрої можуть не мати вбудованої апаратної підтримки декодування WebM. Це може призвести до підвищеного навантаження на процесор під час відтворення відео у форматі WebM на таких пристроях, що потенційно може вплинути на час роботи від акумулятора та продуктивність.": "Limited hardware support: Some older or less common hardware devices may not have built-in hardware decoding support for WebM. This can lead to increased CPU usage when playing WebM videos on such devices, potentially impacting battery life and performance.",
  "Обмежений вибір кодеків: WebM переважно використовує відеокодеки VP8 і VP9, які можуть не мати такої широкої підтримки, як інші кодеки, наприклад, H.264. Це може спричинити проблеми сумісності під час роботи з програмами або пристроями, які підтримують лише певні кодеки.": "Limited codec options: WebM primarily uses the VP8 and VP9 video codecs, which may not be as widely supported as other codecs such as H.264. This can cause compatibility issues when working with applications or devices that only support specific codecs.",
  "Менш поширений: Хоча WebM підтримується основними веб-браузерами, він може бути не таким широко використовуваним або визнаним, як інші відеоформати, такі як MP4. Це може створювати проблеми при поширенні або розповсюдженні відео у форматі WebM серед ширшої аудиторії, яка може бути більш знайома з іншими форматами.": "Less widespread adoption: While WebM is supported by major web browsers, it may not be as widely used or recognized as other video formats like MP4. This could pose challenges when sharing or distributing WebM videos to a wider audience who may be more familiar with other formats.",
  "Компроміси щодо якості: Хоча WebM забезпечує ефективне стиснення, рівень стиснення може впливати на якість відео. Високостиснуті відео у форматі WebM можуть мати візуальні артефакти або знижену якість порівняно з менш стиснутими форматами або форматами без втрат.": "Quality trade-offs: While WebM provides efficient compression, the level of compression can impact the quality of the video. Highly compressed WebM videos may exhibit visual artifacts or reduced quality compared to less compressed or lossless formats.",
  "Обмежена інструментальна та програмна підтримка: Доступність програмного забезпечення для редагування відео, інструментів конвертації та бібліотек, спеціально розроблених для WebM, може бути більш обмеженою порівняно з іншими більш поширеними відеоформатами. Це може зробити певні завдання з редагування чи обробки відео складнішими або вимагати додаткових кроків для роботи з файлами у форматі WebM.": "Limited tooling and software support: The availability of video editing software, conversion tools, and libraries specifically designed for WebM may be more limited compared to other more established video formats. This can make certain video editing or processing tasks more challenging or require additional steps for working with WebM files.",
  "Міркування щодо інфраструктури потокового мовлення: Хоча WebM оптимізовано для потокового передавання, реалізація надійної інфраструктури потокового передавання для відео у форматі WebM може вимагати додаткових налаштувань і конфігурацій порівняно з більш поширеними форматами.": "Streaming infrastructure considerations: While WebM is optimized for streaming, implementing a robust streaming infrastructure for WebM videos may require additional setup and configuration compared to more widely used formats.",
  "Запис аудіо у браузері здійснюється за допомогою формату MPEG-1, аудіофайл може конвертуватись в інші формати, такі як MP3 або WAV, але спочатку він записується тільки з розширенням MPEG-1. Займатись записом медіа файлів через браузер позволяє інструмент UserMedia.": "Audio is recorded in the browser using the MPEG-1 format; the audio file can be converted to other formats, such as MP3 or WAV, but initially it is recorded only with the MPEG-1 extension. The UserMedia tool allows you to record media in the browser.",
  "Cімейство MPEG": "MPEG family",
  "Сімейство форматів MPEG (Moving Picture Experts Group) включає різні стандарти стиснення відео та аудіо. Ось кілька поширених форматів MPEG:": "The MPEG (Moving Picture Experts Group) family of formats includes various standards for video and audio compression. Here are some common MPEG formats:",
  "MPEG-1: Цей стандарт був розроблений для стиснення відео з низькими бітрейтами із помірною якістю зображення. Формат MPEG-1 використовується, наприклад, в відео CD та відео в Інтернеті.": "MPEG-1: This standard was developed to compress low-bitrate video with moderate image quality. The MPEG-1 format is used, for example, in video CDs and video on the Internet.",
  "MPEG-2: Цей стандарт був розроблений для високоякісного стиснення відео з більш високими бітрейтами, що дозволяє використовувати його для відео трансляцій, DVD, супутникового телебачення тощо. Він підтримує стиснення відео в різних роздільностях та режимах зображення.": "MPEG-2: This standard was developed for high-quality video compression at higher bitrates, allowing it to be used for video broadcasts, DVDs, satellite TV, and more. It supports video compression in various resolutions and picture modes.",
  "MPEG-4: Цей стандарт включає багато функціональних можливостей і був розроблений для стиснення відео, аудіо та інших мультимедійних даних з високою якістю. Він підтримує більш широкий спектр можливостей, таких як потокова передача відео в реальному часі, анімація, 3D графіка, аудіосинтез тощо.": "MPEG-4: This standard includes many functionalities and was developed to compress video, audio and other multimedia data with high quality. It supports a wider range of capabilities, such as live video streaming, animation, 3D graphics, audio synthesis, and more.",
  "MPEG-7: Цей стандарт визначає стандартизований набір метаданих для опису мультимедійного вмісту. Він надає структуровану інформацію про вміст, таку як заголовки, описи, ключові слова, авторські права тощо. MPEG-7 допомагає організовувати і пошукові системи та покращує управління мультимедійними даними.": "MPEG-7: This standard defines a standardized set of metadata for describing multimedia content. It provides structured information about the content, such as titles, descriptions, keywords, copyrights, etc. MPEG-7 helps organize and search engines and improves the management of multimedia data.",
  "MPEG-21: Цей стандарт визначає інформаційну рамку та набір стандартів для керування цифровим контентом. Він надає механізми для управління авторськими правами, захисту вмісту, транзакцій з цифровим": "MPEG-21: This standard defines an information framework and set of standards for managing digital content. It provides mechanisms for copyright management, content protection, digital content transactions",
  "Універсальна підтримка: Формат MPEG-1 є широко підтримуваним і може бути відтворений на багатьох пристроях, включаючи комп'ютери, телевізори, DVD-програвачі та портативні пристрої. Це забезпечує сумісність та доступність для відтворення відео з використанням формату MPEG-1.": "Universal support: The MPEG-1 format is widely supported and can be played on many devices, including computers, televisions, DVD players, and portable devices. This ensures compatibility and accessibility for video playback using the MPEG-1 format.",
  "Компресія з низьким бітрейтом: MPEG-1 дозволяє стиснути відео з низьким бітрейтом, що забезпечує менший розмір файлу при прийнятній якості зображення. Це робить його ідеальним для передачі відео через обмежені канали передачі даних, такі як Інтернет з низькою швидкістю або на старіші пристрої з обмеженою ємністю.": "Low bit rate compression: MPEG-1 allows video to be compressed at a low bitrate, which results in a smaller file size with acceptable image quality. This makes it ideal for transmitting video over limited data channels, such as the slow-speed Internet or to older devices with limited capacity.",
  "Підтримка аудіо: MPEG-1 дозволяє вбудовувати аудіо відповідного формату, такого як MP3, що забезпечує високу якість звуку при стисненні. Це дозволяє створювати відео з аудіо доріжкою високої якості.": "Audio support: MPEG-1 allows you to embed audio in a suitable format, such as MP3, which provides high quality audio compression. This allows you to create videos with a high quality audio track.",
  "Простота використання: Формат MPEG-1 має просту структуру та декодування, що робить його легким у використанні для розробників і користувачів. Доступність кодеків та програмного забезпечення для роботи з MPEG-1 також сприяє його популярності та поширеності.": "Ease of use: The MPEG-1 format has a simple structure and decoding, making it easy to use for developers and users. The availability of MPEG-1 codecs and software also contributes to its popularity and widespread use.",
  "Підтримка DVD-відео: MPEG-1 є одним з форматів, які підтримуються на DVD-відео. Це дозволяє створювати DVD-диски з відео, що можуть бути відтворені на DVD-програвачах.": "DVD video support: MPEG-1 is one of the formats supported on DVD video. This allows you to create DVDs with video that can be played on DVD players.",
  "Обмежена якість звуку: Хоча MPEG-1 може підтримувати аудіо стиснення формату MP3, якість звуку може бути обмеженою, особливо при низькому бітрейті. Це може призводити до втрати деталей звуку та артефактів при стисненні.": "Limited audio quality: Although MPEG-1 can support MP3 audio compression, the audio quality can be limited, especially at low bitrates. This can result in loss of audio detail and compression artifacts.",
  "Обмежена підтримка каналів: MPEG-1 обмежений у підтримці багатоканального звуку. Він підтримує стерео звук (два канали), але не підтримує більш складні аудіоформати з багатьма каналами, такі як 5.1 або 7.1 звукові системи.": "Limited channel support: MPEG-1 is limited in its support for multi-channel audio. It supports stereo sound (two channels), but does not support more complex audio formats with many channels, such as 5.1 or 7.1 sound systems.",
  "Високий бітрейт для високої якості: Для досягнення високої якості звуку у форматі MPEG-1 необхідний високий бітрейт, що призводить до більшого розміру аудіофайлу. Це може бути проблематичним при передачі або збереженні файлів з аудіо високої якості.": "High bitrate for high quality: To achieve high audio quality, MPEG-1 requires a high bitrate, which results in a larger audio file size. This can be problematic when transferring or saving files with high quality audio.",
  "Відсутність додаткових функцій: MPEG-1 не має підтримки додаткових функцій, таких як просторовий звук, ефекти обробки звуку, підтримка низької латентності тощо. Це обмежує можливості обробки та покращення якості звуку у форматі MPEG-1.": "No additional features: MPEG-1 does not have support for advanced features such as spatial audio, audio processing effects, low latency support, etc. This limits the possibilities for processing and improving the sound quality of MPEG-1."
}



